RT-Thread/rt-thread/bsp/freescale/platform/devices/MK64F12/include/MK64F12_extension.h
/*
 * Constants & macros for individual USBDCD_TIMER2_BC11 bitfields
 */

/*!
 * @name Register USBDCD_TIMER2_BC11, field CHECK_DM[3:0] (RW)
 *
 * Sets the amount of time (in ms) that the module waits after the device
 * connects to the USB bus until checking the state of the D- line to determine the
 * type of charging port. See "Charger Type Detection." Valid values are 1-15ms.
 */
/*@{*/
/*! @brief Read current value of the USBDCD_TIMER2_BC11_CHECK_DM field. */
#define USBDCD_RD_TIMER2_BC11_CHECK_DM(base) ((USBDCD_TIMER2_BC11_REG(base) & USBDCD_TIMER2_BC11_CHECK_DM_MASK) >> USBDCD_TIMER2_BC11_CHECK_DM_SHIFT)
#define USBDCD_BRD_TIMER2_BC11_CHECK_DM(base) (USBDCD_RD_TIMER2_BC11_CHECK_DM(base))

/*! @brief Set the CHECK_DM field to a new value. */
#define USBDCD_WR_TIMER2_BC11_CHECK_DM(base, value) (USBDCD_RMW_TIMER2_BC11(base, USBDCD_TIMER2_BC11_CHECK_DM_MASK, USBDCD_TIMER2_BC11_CHECK_DM(value)))
#define USBDCD_BWR_TIMER2_BC11_CHECK_DM(base, value) (USBDCD_WR_TIMER2_BC11_CHECK_DM(base, value))
/*@}*/

/*!
 * @name Register USBDCD_TIMER2_BC11, field TVDPSRC_CON[25:16] (RW)
 *
 * Sets the time period (ms) that the module waits after charging port detection
 * before system software must enable the D+ pullup to connect to the USB host.
 * Valid values are 1-1023, but the USB Battery Charging Specification requires a
 * minimum value of 40 ms.
 */
/*@{*/
/*! @brief Read current value of the USBDCD_TIMER2_BC11_TVDPSRC_CON field. */
#define USBDCD_RD_TIMER2_BC11_TVDPSRC_CON(base) ((USBDCD_TIMER2_BC11_REG(base) & USBDCD_TIMER2_BC11_TVDPSRC_CON_MASK) >> USBDCD_TIMER2_BC11_TVDPSRC_CON_SHIFT)
#define USBDCD_BRD_TIMER2_BC11_TVDPSRC_CON(base) (USBDCD_RD_TIMER2_BC11_TVDPSRC_CON(base))

/*! @brief Set the TVDPSRC_CON field to a new value. */
#define USBDCD_WR_TIMER2_BC11_TVDPSRC_CON(base, value) (USBDCD_RMW_TIMER2_BC11(base, USBDCD_TIMER2_BC11_TVDPSRC_CON_MASK, USBDCD_TIMER2_BC11_TVDPSRC_CON(value)))
#define USBDCD_BWR_TIMER2_BC11_TVDPSRC_CON(base, value) (USBDCD_WR_TIMER2_BC11_TVDPSRC_CON(base, value))
/*@}*/

/*******************************************************************************
 * USBDCD_TIMER2_BC12 - TIMER2_BC12 register
 ******************************************************************************/

/*!
 * @brief USBDCD_TIMER2_BC12 - TIMER2_BC12 register (RW)
 *
 * Reset value: 0x00010028U
 *
 * TIMER2_BC12 contains timing parameters for USB Battery Charging
 * Specification, v1.2. Register values can be written that are not compliant with the USB
 * Battery Charging Specification, so care should be taken when overwriting the
 * default values.
 */
/*!
 * @name Constants and macros for entire USBDCD_TIMER2_BC12 register
 */
/*@{*/
#define USBDCD_RD_TIMER2_BC12(base) (USBDCD_TIMER2_BC12_REG(base))
#define USBDCD_WR_TIMER2_BC12(base, value) (USBDCD_TIMER2_BC12_REG(base) = (value))
#define USBDCD_RMW_TIMER2_BC12(base, mask, value) (USBDCD_WR_TIMER2_BC12(base, (USBDCD_RD_TIMER2_BC12(base) & ~(mask)) | (value)))
#define USBDCD_SET_TIMER2_BC12(base, value) (USBDCD_WR_TIMER2_BC12(base, USBDCD_RD_TIMER2_BC12(base) |  (value)))
#define USBDCD_CLR_TIMER2_BC12(base, value) (USBDCD_WR_TIMER2_BC12(base, USBDCD_RD_TIMER2_BC12(base) & ~(value)))
#define USBDCD_TOG_TIMER2_BC12(base, value) (USBDCD_WR_TIMER2_BC12(base, USBDCD_RD_TIMER2_BC12(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBDCD_TIMER2_BC12 bitfields
 */

/*!
 * @name Register USBDCD_TIMER2_BC12, field TVDMSRC_ON[9:0] (RW)
 *
 * Sets the amount of time (in ms) that the module enables the VDM_SRC. Valid
 * values are 0-40ms.
 */
/*@{*/
/*! @brief Read current value of the USBDCD_TIMER2_BC12_TVDMSRC_ON field. */
#define USBDCD_RD_TIMER2_BC12_TVDMSRC_ON(base) ((USBDCD_TIMER2_BC12_REG(base) & USBDCD_TIMER2_BC12_TVDMSRC_ON_MASK) >> USBDCD_TIMER2_BC12_TVDMSRC_ON_SHIFT)
#define USBDCD_BRD_TIMER2_BC12_TVDMSRC_ON(base) (USBDCD_RD_TIMER2_BC12_TVDMSRC_ON(base))

/*! @brief Set the TVDMSRC_ON field to a new value. */
#define USBDCD_WR_TIMER2_BC12_TVDMSRC_ON(base, value) (USBDCD_RMW_TIMER2_BC12(base, USBDCD_TIMER2_BC12_TVDMSRC_ON_MASK, USBDCD_TIMER2_BC12_TVDMSRC_ON(value)))
#define USBDCD_BWR_TIMER2_BC12_TVDMSRC_ON(base, value) (USBDCD_WR_TIMER2_BC12_TVDMSRC_ON(base, value))
/*@}*/

/*!
 * @name Register USBDCD_TIMER2_BC12, field TWAIT_AFTER_PRD[25:16] (RW)
 *
 * Sets the amount of time (in ms) that the module waits after primary detection
 * before start to secondary detection. Valid values are 1-1023ms. Default is
 * 1ms.
 */
/*@{*/
/*! @brief Read current value of the USBDCD_TIMER2_BC12_TWAIT_AFTER_PRD field. */
#define USBDCD_RD_TIMER2_BC12_TWAIT_AFTER_PRD(base) ((USBDCD_TIMER2_BC12_REG(base) & USBDCD_TIMER2_BC12_TWAIT_AFTER_PRD_MASK) >> USBDCD_TIMER2_BC12_TWAIT_AFTER_PRD_SHIFT)
#define USBDCD_BRD_TIMER2_BC12_TWAIT_AFTER_PRD(base) (USBDCD_RD_TIMER2_BC12_TWAIT_AFTER_PRD(base))

/*! @brief Set the TWAIT_AFTER_PRD field to a new value. */
#define USBDCD_WR_TIMER2_BC12_TWAIT_AFTER_PRD(base, value) (USBDCD_RMW_TIMER2_BC12(base, USBDCD_TIMER2_BC12_TWAIT_AFTER_PRD_MASK, USBDCD_TIMER2_BC12_TWAIT_AFTER_PRD(value)))
#define USBDCD_BWR_TIMER2_BC12_TWAIT_AFTER_PRD(base, value) (USBDCD_WR_TIMER2_BC12_TWAIT_AFTER_PRD(base, value))
/*@}*/

/*
 * MK64F12 VREF
 *
 * Voltage Reference
 *
 * Registers defined in this header file:
 * - VREF_TRM - VREF Trim Register
 * - VREF_SC - VREF Status and Control Register
 */

#define VREF_INSTANCE_COUNT (1U) /*!< Number of instances of the VREF module. */
#define VREF_IDX (0U) /*!< Instance number for VREF. */

/*******************************************************************************
 * VREF_TRM - VREF Trim Register
 ******************************************************************************/

/*!
 * @brief VREF_TRM - VREF Trim Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register contains bits that contain the trim data for the Voltage
 * Reference.
 */
/*!
 * @name Constants and macros for entire VREF_TRM register
 */
/*@{*/
#define VREF_RD_TRM(base)        (VREF_TRM_REG(base))
#define VREF_WR_TRM(base, value) (VREF_TRM_REG(base) = (value))
#define VREF_RMW_TRM(base, mask, value) (VREF_WR_TRM(base, (VREF_RD_TRM(base) & ~(mask)) | (value)))
#define VREF_SET_TRM(base, value) (VREF_WR_TRM(base, VREF_RD_TRM(base) |  (value)))
#define VREF_CLR_TRM(base, value) (VREF_WR_TRM(base, VREF_RD_TRM(base) & ~(value)))
#define VREF_TOG_TRM(base, value) (VREF_WR_TRM(base, VREF_RD_TRM(base) ^  (value)))
/*@}*/

